{
   "Language": {
      "Type": "MVON# Basic",
      "Keywords": [
         {
            "key": "For",
            "icon": 14,
            "index": 1,
            "documentation": "The FOR statement begin a FOR/NEXT Loop",
            "detail": "FOR var = start TO end {STEP incr}\r\n\r\n{UNTIL/WHITE condition}\r\nNEXT var"
         },
         {
            "key": "Open",
            "icon": 14,
            "index": 2,
            "documentation": "The OPEN statement opens a file for data processing.\r\nIf the OPEN statement fails, it executes any statements associated with an ELSE clause. If the OPEN is successful it will execute any statements associated with a THEN clause. Note that either one or both of the THEN and ELSE clauses are required.",
            "detail": "OPEN {'DICT'},filename TO filevariable {ON ERROR} THEN/ELSE"
         },
         {
            "key": "Dcount",
            "icon": 3,
            "index": 3,
            "documentation": "The DCOUNT function counts the number of delimited elements in an expression.",
            "detail": "DCOUNT(expr1,Expr2)"
         },
         {
            "key": "Date()",
            "icon": 3,
            "index": 4,
            "documentation": "The internal form of the date is expressed as the number of days before or since December 31, 1967. The internal format of December 31, 1967 is zero, any day before is returned as a negative number any day past is returned as a positive number.",
            "detail": "DATE()"
         },
         {
            "key": "Select",
            "icon": 14,
            "index": 5,
            "documentation": "The SELECT statement creates a select list of elements in a specified variable or list number. If no list number or variable is present, the default select list '0' is used.",
            "detail": "SELECT filevariable TO listnum\r\nSELECT filevariable TO variable"
         },
         {
            "key": "ReadNext",
            "icon": 14,
            "index": 6,
            "documentation": "The READNEXT statement reads the next entry from a list number or variable. If no list number or variable is specified, the default listy '0' is used. If an entry is available the THEN clause is execute otherwise the ELSE clause is executed",
            "detail": "READNEXT var FROM listnumber THEN/ELSE\r\nREADNEXT var from variable THEN/ELSE"
         },
         {
            "key": "Read",
            "icon": 14,
            "index": 7,
            "documentation": "The READ statement reads a record from a file with supplied key. If the key exists the THEN statements are executed otherwise the ELSE statements are executed. the ON ERROR clause is executed if am error occurs during the READ process.",
            "detail": "READ record FROM filevariable, key {ON ERROR} THEN/ELSE"
         },
         {
            "key": "Readv",
            "icon": 14,
            "index": 8,
            "documentation": "The READV statement reads an attribute from a record from a file with supplied key. If the key exists the THEN statements are executed otherwise the ELSE statements are executed. the ON ERROR clause is executed if am error occurs during the READ process.",
            "detail": "READV record FROM filevariable, key, attribute {ON ERROR} THEN/ELSE"
         },
         {
            "key": "Repeat",
            "icon": 14,
            "index": 9,
            "documentation": "The REPEAT statement marks the end of a LOOP statement",
            "detail": "REPEAT"
         },
         {
            "key": "Crt",
            "icon": 14,
            "index": 10,
            "documentation": "The CRT statement displays text to terminal window. If the optional ':' is appended no carraige return is appended to the text",
            "detail": "CRT expression\r\nCRT expression:"
         },
         {
            "key": "Dim",
            "icon": 14,
            "index": 11,
            "documentation": "The DIM statement creates a dimessioned array with supplied no of elements. A dimensioned array can be single or multidemension.",
            "detail": "DIM variable(depth)\r\nDIM variable(depth,width)"
         },
         {
            "key": "Debug",
            "icon": 14,
            "index": 12,
            "documentation": "The DEBUG statement forces a program to enter the debugger at a specific point. This only applies if the program has been compiled in debug mode.\r\nBASIC filename programname (D",
            "detail": "DEBUG"
         },
         {
            "key": "Call",
            "icon": 14,
            "index": 13,
            "documentation": "The CALL statement passes program execution to another subroutine. The subroutine must be compiled and cataloged.",
            "detail": "CALL subroutine{(arg1,arg2,...)}\r\nCALL @variable{(arg1,arg2,...)}"
         },
         {
            "key": "Trim",
            "icon": 3,
            "index": 14,
            "documentation": "TRIM(expression)",
            "detail": "The TRIM function removes all leading and trailing white space from a string"
         },
         {
            "key": "Trimf",
            "icon": 3,
            "index": 15,
            "documentation": "The TRIMF function removes all leading white space from a string",
            "detail": "TRIMF(expression)"
         },
         {
            "key": "Trimb",
            "icon": 3,
            "index": 16,
            "documentation": "The TRIMB function removes all triling white space from a string",
            "detail": "TRIMB(expression)"
         },
         {
            "key": "Len",
            "icon": 3,
            "index": 17,
            "documentation": "The LEN function return the length of an expression",
            "detail": "LEN(expression)"
         },
         {
            "key": "Mat",
            "icon": 14,
            "index": 18,
            "documentation": "The MAT statement allows you to initiase all the elements of an array to a specific value",
            "detail": "The MAT statement allows you to initiase all the elements of an array to a specific value"
         },
         {
            "key": "Match",
            "icon": 14,
            "index": 19,
            "documentation": "The pattern matching operator, MATCH, and its synonym, MATCHES, compare a string expression to a pattern.",
            "detail": "expression MATCH/MATCHES pattern"
         },
         {
            "key": "Write",
            "icon": 14,
            "index": 20,
            "documentation": "The WRITE statement writes a record to file using the specified key. The file must be opened before the WRITE statement can be used. If an error occurs the ON ERROR clause is executed",
            "detail": "WRITE record ON filevariable , key {ON ERROR}"
         },
         {
            "key": "Writev",
            "icon": 14,
            "index": 21,
            "documentation": "The WRITEV statement writes an attribute to file using the specified key and attribute number. The file must be opened before the WRITE statement can be used. If an error occurs the ON ERROR clause is executed",
            "detail": "WRITEV record ON filevariable , key , attribute {ON ERROR}"
         },
         {
            "key": "Begin Case",
            "icon": 14,
            "index": 22,
            "documentation": "The BEGIN CASE statement starts a case block. The block is terminates with an END CASE statement.",
            "detail": "BEGIN CASE\r\n\r\n...\r\nEND CASE"
         },
         {
            "key": "Case",
            "icon": 14,
            "index": 23,
            "documentation": "The CASE statement performs a test and if it resolves to true, all statement below the CASE are executed until the next CASE statement or END CASE statement",
            "detail": "CASE expr operator value"
         },
         {
            "key": "Abs",
            "icon": 3,
            "index": 23,
            "documentation": "The ABS function returns the absolute value of an expression",
            "detail": "ABS(expression)"
         },
         {
            "key": "Index",
            "icon": 3,
            "index": 25,
            "documentation": "The INDEX function returns the position of a sub string in a string. The optional occurance value set the occurance of the sub string in a string",
            "detail": "INDEX(expression,substring)\r\nINDEX(expression,substring,occurance)"
         },
         {
            "key": "@Am",
            "icon": 21,
            "index": 26,
            "documentation": "Return the attribute marker CHAR(254)",
            "detail": "@AM"
         },
         {
            "key": "@Vm",
            "icon": 21,
            "index": 27,
            "documentation": "Return the value marker CHAR(253)",
            "detail": "@VM"
         },
         {
            "key": "@Svm",
            "icon": 21,
            "index": 28,
            "documentation": "Return the subvalue marker CHAR(252)",
            "detail": "@SVM"
         },
         {
            "key": "@Tm",
            "icon": 21,
            "index": 29,
            "documentation": "Return the text marker CHAR(251)",
            "detail": "@TM"
         },
         {
            "key": "Execute",
            "icon": 3,
            "index": 30,
            "documentation": "The EXECUTE statement executes the supplied arguments at a TCL level. If the oiptional {CAPTURING variable} clause is supplied, all terminal io from the statement will be returned in the variable. A active select list can be passed to the statement by specifying {PASSLIST listno}. If the optional {SETTING variable} is specified, the no of items selected will be returned in the variable",
            "detail": "EXECUTE statements {PASSLIST listnumber} {Capturing variable} {SETTING variable}"
         },
         {
            "key": "Loop",
            "icon": 14,
            "index": 31,
            "documentation": "The LOOP statement begins a code block for looping. The loop is exited when either the WHILE/UNTIL is satisfield or the EXIT clause is executed",
            "detail": "LOOP\r\n\r\n{UNTIL/WHILE condition}\r\n\r\nREPEAT"
         },
         {
            "key": "End Case",
            "icon": 3,
            "index": 32,
            "documentation": "The END CASE statement terminates a CASE block. There should be a corrosponding END CASE for each BEGIN CASE.",
            "detail": "END CASE"
         },
         {
            "key": "End",
            "icon": 14,
            "index": 33,
            "documentation": "The END statement terminates a THEN/ELSE block.",
            "detail": "END"
         },
         {
            "key": "Upcase",
            "icon": 3,
            "index": 34,
            "documentation": "The UPCASE function converts an expression to all upper case characters.",
            "detail": "UPCASE(expression)"
         },
         {
            "key": "Downcase",
            "icon": 3,
            "index": 35,
            "documentation": "The DOWNCASE function converts an expression to all lower case characters.",
            "detail": "DOWNCASE(expression)"
         },
         {
            "key": "Dquote",
            "icon": 3,
            "index": 36,
            "documentation": "The DQUOTE function return a string enclosed in double quotes.",
            "detail": "DQUOTE(Expression)"
         },
         {
            "key": "Squote",
            "icon": 3,
            "index": 37,
            "documentation": "The SQUOTE function return a string enclosed in single quotes.",
            "detail": "DQUOTE(Expression)"
         },
         {
            "key": "Print",
            "icon": 14,
            "index": 38,
            "documentation": "The PRINT statement sends out to a print channel. If no printer is on, the output goes to the terminal.\r\nThe optional : at the end will suppress a carriage return being appended to the expression",
            "detail": "PRINT expression{:}\r\nPRINT ON channel expression{:}"
         },
         {
            "key": "Printer On",
            "icon": 14,
            "index": 39,
            "documentation": "The PRINTER ON statement turns on the printing on to the printer.",
            "detail": "PRINTER ON"
         },
         {
            "key": "Printer Off",
            "icon": 14,
            "index": 40,
            "documentation": "The PRINTER OFF statement turns off printing to the printer. All subsequent PRINT statements will print to the terminal.",
            "detail": "PRINTER OFF"
         },
         {
            "key": "Printer Close",
            "icon": 14,
            "index": 41,
            "documentation": "The PRINTER CLOSE statement closes the print channel. All data spooled will begin printing",
            "detail": "PRINTER CLOSE"
         },
         {
            "key": "Oconv",
            "icon": 3,
            "index": 42,
            "documentation": "The OCONV() function converts the value of expression to its external representation according to the conversion codes specified in conversioncode.",
            "detail": "OCONV(expression,conversioncode)"
         },
         {
            "key": "Iconv",
            "icon": 3,
            "index": 43,
            "documentation": "The OCONV() function converts the value of expression to its internal representation according to the conversion codes in conversioncode.",
            "detail": "ICONV(expression,conversioncode)"
         },
         {
            "key": "Int",
            "icon": 3,
            "index": 43,
            "documentation": "The INT function returns the integer portion of a number with no decimal points.",
            "detail": "INT(expression)"
         },
         {
            "key": "$Include",
            "icon": 14,
            "index": 45,
            "documentation": "The $INCLUDE directive inserts the program specified into the current source code. If the optional filename is specified the code is read from the file.",
            "detail": "$INCLUDE programname\r\n$INCLUDE filename programname"
         },
         {
            "key": "Next",
            "icon": 14,
            "index": 46,
            "documentation": "The NEXT statement terminates a FOR loop. Control is passed back to the FOR statement and the variable is incremented or decremented.",
            "detail": "NEXT variable"
         },
         {
            "key": "Continue",
            "icon": 14,
            "index": 47,
            "documentation": "The Continue statement returns program execution to the top of the FOR/LOOP loop.",
            "detail": "CONTINUE"
         },
         {
            "key": "Return",
            "icon": 14,
            "index": 48,
            "documentation": "The RETURN statement returns program execution to the following statement after a GOSUB. It also returns from a BASIC subroutine if no GOSUB is active.\r\nThe second form of the RETURN statment is used in a FUNCTION call, expression is returned as the value for the function",
            "detail": "RETURN\r\nRETURN(expression)"
         },
         {
            "key": "Exit",
            "icon": 3,
            "index": 49,
            "documentation": "The EXIT statement exits a LOOP or FOR loop.",
            "detail": "EXIT"
         },
         {
            "key": "Change",
            "icon": 3,
            "index": 50,
            "documentation": "The CHANGE function replaces one string with another in an expression.",
            "detail": "CHANGE(Expression,oldstring,newstring)"
         },
         {
            "key": "Lower",
            "icon": 3,
            "index": 51,
            "documentation": "The LOWER function lowers each marker by 1. AM > VM, VM > SVM etc",
            "detail": "Lower(Expression)"
         },
         {
            "key": "Raise",
            "icon": 3,
            "index": 52,
            "documentation": "The RAISE function raises each marker by 1. SVM > VM, VM > AM etc.",
            "detail": "RAISE(Expression)"
         },
         {
            "key": "Delete",
            "icon": 3,
            "index": 53,
            "documentation": "The DELETE functions removes an attrribute, value or subvalue from a dynamic array.",
            "detail": "DELETE(variable,am)\r\nDELETE(variable,am,vm)\r\nDELETE(variable,am,vm,svm)"
         },
         {
            "key": "Delete",
            "icon": 14,
            "index": 54,
            "documentation": "The DELETE Statement delete a record from a file",
            "detail": "DELETE filevariable , recordid"
         },
         {
            "key": "Convert",
            "icon": 14,
            "index": 55,
            "documentation": "The CONVERT statement converts a series of characters to alternate characters in a dynamic array. If characters contains more that 1 character, each character is converted to the corrosponding character in newcharacters",
            "detail": "CONVERT characters TO newcharacters IN variable"
         },
         {
            "key": "Begin Transaction",
            "icon": 14,
            "index": 56,
            "documentation": "The BEGIN TRANSACTION statement indicates the start of a transaction. All writes are batched together and are only commited when the COMMIT statement is execute.",
            "detail": ""
         },
         {
            "key": "End Transaction",
            "icon": 14,
            "index": 57,
            "documentation": "The END TRANSACTION statement indicates the end of a transaction. After a COMMIT or ROLLBACK, execution continues at the statements following the END TRANSACTION.",
            "detail": "END TRANSACTION"
         },
         {
            "key": "Commit",
            "icon": 14,
            "index": 58,
            "documentation": "The COMMIT statement commits all writes in the transaction to the disk and continues executing at the statement following the END TRANSCTION.",
            "detail": "COMMIT"
         },
         {
            "key": "Rollback",
            "icon": 14,
            "index": 59,
            "documentation": "The ROLLBACK statement discards all writes in the transaction and continues executing at the statement following the END TRANSCTION.",
            "detail": "ROLLBACK"
         },
         {
            "key": "Readu",
            "icon": 14,
            "index": 60,
            "documentation": "The READU statement reads a record from a file with supplied key and attempts to lock the record. If the record is already locked the statements following the LOCKED clause are executed. If no LOCKED clause is present, execution stops and the record is released. If the key exists the THEN statements are executed otherwise the ELSE statements are executed. the ON ERROR clause is executed if am error occurs during the READ process.",
            "detail": "READU record FROM filevariable, key {LOCKED} {ON ERROR} THEN/ELSE"
         },
         {
            "key": "Writeu",
            "icon": 14,
            "index": 61,
            "documentation": "The WRITEU statements writes the record to a file using the key. If the record was previously locked, the lock is not removed and must be explicitly released using the RELEASE statement",
            "detail": "WRITEU record ON filevariable , key"
         },
         {
            "key": "Program",
            "icon": 14,
            "index": 62,
            "documentation": "The PROGRAM statement defines this code as a program with no arguments. If must be the first statement in your code",
            "detail": "PROGRAM"
         },
         {
            "key": "Subroutine",
            "icon": 14,
            "index": 63,
            "documentation": "The SUBROUTINE statement defines this code as a subroutine with optional arguments. Subroutines are called with the BASIC CALL statement.If must be the first statement in your code",
            "detail": "SUBROUTINE subroutinename\r\nSUBROUTINE suboutinename(arg1,...)"
         },
         {
            "key": "End Else",
            "icon": 14,
            "index": 64,
            "documentation": "The END ELSE terminates the THEN portion and begin the ELSE portion of a code block",
            "detail": "END ELSE"
         },
         {
            "key": "Readlist",
            "icon": 14,
            "index": 65,
            "documentation": "The READLIST statement reads all the remaining keys from the list number or list variable into a dynamic array. If keys are present in the list the THEN clause is executed else the ELSE clause is exected",
            "detail": "READLIST variable FROM {listnumber|listvariable} THEN/ELSE"
         },
         {
            "key": "Until",
            "icon": 14,
            "index": 66,
            "documentation": "The UNTIL statement terminates a FOR or LOOP loop when the specified expression is true. The optional DO is required in a LOOP",
            "detail": "UNTIL expr {DO}"
         },
         {
            "key": "While",
            "icon": 14,
            "index": 67,
            "documentation": "The WHILE statement terminates a FOR or LOOP loop when the specified expression is true. The optional DO is required in a LOOP",
            "detail": "WHILE expr {DO}"
         },
         {
            "key": "Goto",
            "icon": 14,
            "index": 68,
            "documentation": "The GOTO statements transfer program execution to the label specified after the GOTO statement",
            "detail": "GOTO label\r\nGO label\r\nGO TO label"
         },
         {
            "key": "Unassigned",
            "icon": 3,
            "index": 69,
            "documentation": "The UNASSIGNED function return True(1) when a variables has previously been assigned a value and False(0) when it has not bee assigned a value",
            "detail": "UNASSIGNED(variable)"
         },
         {
            "key": "Release",
            "icon": 14,
            "index": 70,
            "documentation": "The RELEASE statement release a record lock that was previously set with a READU. If only the filevariable argument is specified, all locks for that file are release. If no arguments are specified, all locks set by the user are released.",
            "detail": "RELEASE\r\nRELEASE filevariable\r\nRELEASE filevariable, key"
         },
         {
            "key": "Stop",
            "icon": 3,
            "index": 71,
            "documentation": "The STOP statement terminates the current program and return to the calling program or TCL.",
            "detail": "STOP"
         },
         {
            "key": "Equate",
            "icon": 3,
            "index": 72,
            "documentation": "The EQU/EQUATE statement replaces all occurances of the equated definition with it's equivalant Value in your program.",
            "detail": "EQUATE definition TO value\r\nEQU definition TO value"
         },
         {
            "key": "Field",
            "icon": 3,
            "index": 73,
            "documentation": "The FIELD function extracts a portion of an expression by splitting the string using the seperator provided and returning the element in the count position. If the optional notoretrun is specified, Field returns that number of fields inluding the seperator.",
            "detail": "FIELD(expression,seperator,count)\r\nFIELD(expression,seperator,count,notoreturn)"
         },
         {
            "key": "Not",
            "icon": 3,
            "index": 74,
            "documentation": "Then NOT function return True (1) if the expression results in False or blank and False if the expression results in True or positive",
            "detail": "NOT(Expression)"
         },
         {
            "key": "Common",
            "icon": 14,
            "index": 75,
            "documentation": "The COMMON statement allows you to define global variables across all programs that include the same common statement. If optional /name/ is supplied, this is a Named Common which allows you to create specific global variables associated with that common",
            "detail": "COM {/name/}variable,variable,...\r\nCOMMON {/name/}variable,variable,..."
         },
         {
            "key": "Char",
            "icon": 3,
            "index": 76,
            "documentation": "The CHAR function returns the ascii character defined by the expression",
            "detail": "CHAR(expression)"
         },
         {
            "key": "FormList",
            "icon": 14,
            "index": 77,
            "documentation": "The FORMLIST statement converts a variable selectlist to a numbered selectlist",
            "detail": "FORMLIST variable TO Listnumber"
         },
         {
            "key": "Gosub",
            "icon": 3,
            "index": 78,
            "documentation": "The GOSUB statements transfers execution to the internal subroutine named. Exection is continued with the first statement after the GOSUB when a RETURN is encounterd",
            "detail": "GOSUB label{:}"
         }
      ]
   }
}